Model: "BinaryClassification_Adapter_Tenney"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_layer (InputLayer)        [(None, 1, 1024, 26) 0                                            
__________________________________________________________________________________________________
mean_concat (MeanConcat)        (None, 1, 1024)      0           input_layer[0][0]                
__________________________________________________________________________________________________
tf_op_layer_expand_dims (Tensor [(None, 1, 1024, 1)] 0           mean_concat[0][0]                
__________________________________________________________________________________________________
adapter_pooler (AdapterPooler)  (None, 1, 386, 1)    395650      tf_op_layer_expand_dims[0][0]    
__________________________________________________________________________________________________
tf_op_layer_Reshape (TensorFlow [(None, 1, 386)]     0           adapter_pooler[0][0]             
__________________________________________________________________________________________________
tf_op_layer_strided_slice (Tens [(None, 1, 1024)]    0           input_layer[0][0]                
__________________________________________________________________________________________________
tf_op_layer_concat (TensorFlowO [(None, 1, 1410)]    0           tf_op_layer_Reshape[0][0]        
                                                                 tf_op_layer_strided_slice[0][0]  
__________________________________________________________________________________________________
tf_op_layer_Squeeze (TensorFlow [(None, 1410)]       0           tf_op_layer_concat[0][0]         
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            2822        tf_op_layer_Squeeze[0][0]        
==================================================================================================
Total params: 398,472
Trainable params: 398,472
Non-trainable params: 0