Model: "Xception_BC"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_15 (InputLayer)           [(None, 1, 1024, 26) 0                                            
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 1, 341, 64)   4992        input_15[0][0]                   
__________________________________________________________________________________________________
batch_normalization_105 (BatchN (None, 1, 341, 64)   256         conv2d_45[0][0]                  
__________________________________________________________________________________________________
activation_74 (Activation)      (None, 1, 341, 64)   0           batch_normalization_105[0][0]    
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 1, 339, 128)  24576       activation_74[0][0]              
__________________________________________________________________________________________________
batch_normalization_106 (BatchN (None, 1, 339, 128)  512         conv2d_46[0][0]                  
__________________________________________________________________________________________________
activation_75 (Activation)      (None, 1, 339, 128)  0           batch_normalization_106[0][0]    
__________________________________________________________________________________________________
separable_conv2d_60 (SeparableC (None, 1, 339, 256)  33152       activation_75[0][0]              
__________________________________________________________________________________________________
batch_normalization_108 (BatchN (None, 1, 339, 256)  1024        separable_conv2d_60[0][0]        
__________________________________________________________________________________________________
activation_76 (Activation)      (None, 1, 339, 256)  0           batch_normalization_108[0][0]    
__________________________________________________________________________________________________
separable_conv2d_61 (SeparableC (None, 1, 339, 512)  131840      activation_76[0][0]              
__________________________________________________________________________________________________
batch_normalization_109 (BatchN (None, 1, 339, 512)  2048        separable_conv2d_61[0][0]        
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 1, 170, 512)  65536       activation_75[0][0]              
__________________________________________________________________________________________________
average_pooling2d_15 (AveragePo (None, 1, 170, 512)  0           batch_normalization_109[0][0]    
__________________________________________________________________________________________________
batch_normalization_107 (BatchN (None, 1, 170, 512)  2048        conv2d_47[0][0]                  
__________________________________________________________________________________________________
add_30 (Add)                    (None, 1, 170, 512)  0           average_pooling2d_15[0][0]       
                                                                 batch_normalization_107[0][0]    
__________________________________________________________________________________________________
tf_op_layer_strided_slice_13 (T [(None, 1, 1024)]    0           input_15[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_14 (Gl (None, 512)          0           add_30[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_Squeeze_11 (TensorF [(None, 1024)]       0           tf_op_layer_strided_slice_13[0][0
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 1536)         0           global_average_pooling2d_14[0][0]
                                                                 tf_op_layer_Squeeze_11[0][0]     
__________________________________________________________________________________________________
dense_2_final (Dense)           (None, 2)            3074        concatenate_4[0][0]              
==================================================================================================
Total params: 269,058
Trainable params: 266,114
Non-trainable params: 2,944
__________________________________________________________________________________________________