Model: "Xception_BC"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1, 1024, 26) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1, 341, 64)   4992        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 1, 341, 64)   256         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 1, 341, 64)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 339, 128)  24576       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1, 339, 128)  512         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 339, 128)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
separable_conv2d (SeparableConv (None, 1, 339, 256)  33152       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 1, 339, 256)  1024        separable_conv2d[0][0]           
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 1, 339, 256)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 1, 339, 512)  131840      activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1, 339, 512)  2048        separable_conv2d_1[0][0]         
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1, 170, 512)  65536       activation_1[0][0]               
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 1, 170, 512)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1, 170, 512)  2048        conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 1, 170, 512)  0           average_pooling2d[0][0]          
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           add[0][0]                        
__________________________________________________________________________________________________
dense_2_final (Dense)           (None, 2)            1026        global_average_pooling2d[0][0]   
==================================================================================================
Total params: 267,010
Trainable params: 264,066
Non-trainable params: 2,944
__________________________________________________________________________________________________