Model: "BERT_SQuADv2_BinaryClassification"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_ids (InputLayer)          [(None, 386)]        0                                            
__________________________________________________________________________________________________
input_masks (InputLayer)        [(None, 386)]        0                                            
__________________________________________________________________________________________________
input_tokens (InputLayer)       [(None, 386)]        0                                            
__________________________________________________________________________________________________
tf_bert_model (TFBertModel)     ((None, 386, 1024),  335141888   input_ids[0][0]                  
                                                                 input_masks[0][0]                
                                                                 input_tokens[0][0]               
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            2050        tf_bert_model[0][1]              
==================================================================================================
Total params: 335,143,938
Trainable params: 335,143,938
Non-trainable params: 0
__________________________________________________________________________________________________