Model: "BinaryClassification_Adapter_Tenney"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (InputLayer)     [(None, 1, 1024, 26)]     0         
_________________________________________________________________
bert_concat_35 (BertConcat)  (None, 1, 1024)           27        
_________________________________________________________________
tf_op_layer_Squeeze_30 (Tens [(None, 1024)]            0         
_________________________________________________________________
dense_85 (Dense)             (None, 2)                 2050      
=================================================================
Total params: 2,077
Trainable params: 2,077
Non-trainable params: 0
_________________________________________________________________