{"class_name": "Model", "config": {"name": "Xception_QnA", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 386, 1024, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_0", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_0", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_1", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat", "trainable": true, "dtype": "float32", "node_def": {"name": "concat", "op": "ConcatV2", "input": ["conv_2d_1xS_0/Identity", "conv_2d_1xS_1/Identity", "concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat", "inbound_nodes": [[["conv_2d_1xS_0", 0, 0, {}], ["conv_2d_1xS_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_2", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_2", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_1", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_1", "op": "ConcatV2", "input": ["concat", "conv_2d_1xS_2/Identity", "concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_1", "inbound_nodes": [[["tf_op_layer_concat", 0, 0, {}], ["conv_2d_1xS_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_3", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_3", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_2", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_2", "op": "ConcatV2", "input": ["concat_1", "conv_2d_1xS_3/Identity", "concat_2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_2", "inbound_nodes": [[["tf_op_layer_concat_1", 0, 0, {}], ["conv_2d_1xS_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_4", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_4", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_3", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_3", "op": "ConcatV2", "input": ["concat_2", "conv_2d_1xS_4/Identity", "concat_3/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_3", "inbound_nodes": [[["tf_op_layer_concat_2", 0, 0, {}], ["conv_2d_1xS_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_5", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_5", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_4", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_4", "op": "ConcatV2", "input": ["concat_3", "conv_2d_1xS_5/Identity", "concat_4/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_4", "inbound_nodes": [[["tf_op_layer_concat_3", 0, 0, {}], ["conv_2d_1xS_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_6", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_6", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_5", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_5", "op": "ConcatV2", "input": ["concat_4", "conv_2d_1xS_6/Identity", "concat_5/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_5", "inbound_nodes": [[["tf_op_layer_concat_4", 0, 0, {}], ["conv_2d_1xS_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_7", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_7", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_6", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_6", "op": "ConcatV2", "input": ["concat_5", "conv_2d_1xS_7/Identity", "concat_6/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_6", "inbound_nodes": [[["tf_op_layer_concat_5", 0, 0, {}], ["conv_2d_1xS_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_8", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_8", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_7", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_7", "op": "ConcatV2", "input": ["concat_6", "conv_2d_1xS_8/Identity", "concat_7/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_7", "inbound_nodes": [[["tf_op_layer_concat_6", 0, 0, {}], ["conv_2d_1xS_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_9", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_9", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_8", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_8", "op": "ConcatV2", "input": ["concat_7", "conv_2d_1xS_9/Identity", "concat_8/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_8", "inbound_nodes": [[["tf_op_layer_concat_7", 0, 0, {}], ["conv_2d_1xS_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_10", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_10", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_9", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_9", "op": "ConcatV2", "input": ["concat_8", "conv_2d_1xS_10/Identity", "concat_9/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_9", "inbound_nodes": [[["tf_op_layer_concat_8", 0, 0, {}], ["conv_2d_1xS_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_11", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_11", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_10", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_10", "op": "ConcatV2", "input": ["concat_9", "conv_2d_1xS_11/Identity", "concat_10/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_10", "inbound_nodes": [[["tf_op_layer_concat_9", 0, 0, {}], ["conv_2d_1xS_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_12", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_12", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_11", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_11", "op": "ConcatV2", "input": ["concat_10", "conv_2d_1xS_12/Identity", "concat_11/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_11", "inbound_nodes": [[["tf_op_layer_concat_10", 0, 0, {}], ["conv_2d_1xS_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_13", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_13", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_12", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_12", "op": "ConcatV2", "input": ["concat_11", "conv_2d_1xS_13/Identity", "concat_12/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_12", "inbound_nodes": [[["tf_op_layer_concat_11", 0, 0, {}], ["conv_2d_1xS_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_14", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_14", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_13", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_13", "op": "ConcatV2", "input": ["concat_12", "conv_2d_1xS_14/Identity", "concat_13/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_13", "inbound_nodes": [[["tf_op_layer_concat_12", 0, 0, {}], ["conv_2d_1xS_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_15", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_15", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_14", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_14", "op": "ConcatV2", "input": ["concat_13", "conv_2d_1xS_15/Identity", "concat_14/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_14", "inbound_nodes": [[["tf_op_layer_concat_13", 0, 0, {}], ["conv_2d_1xS_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_16", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_16", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_15", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_15", "op": "ConcatV2", "input": ["concat_14", "conv_2d_1xS_16/Identity", "concat_15/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_15", "inbound_nodes": [[["tf_op_layer_concat_14", 0, 0, {}], ["conv_2d_1xS_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_17", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_17", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_16", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_16", "op": "ConcatV2", "input": ["concat_15", "conv_2d_1xS_17/Identity", "concat_16/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_16", "inbound_nodes": [[["tf_op_layer_concat_15", 0, 0, {}], ["conv_2d_1xS_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_18", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_18", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_17", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_17", "op": "ConcatV2", "input": ["concat_16", "conv_2d_1xS_18/Identity", "concat_17/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_17", "inbound_nodes": [[["tf_op_layer_concat_16", 0, 0, {}], ["conv_2d_1xS_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_19", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_19", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_18", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_18", "op": "ConcatV2", "input": ["concat_17", "conv_2d_1xS_19/Identity", "concat_18/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_18", "inbound_nodes": [[["tf_op_layer_concat_17", 0, 0, {}], ["conv_2d_1xS_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_20", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_20", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_19", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_19", "op": "ConcatV2", "input": ["concat_18", "conv_2d_1xS_20/Identity", "concat_19/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_19", "inbound_nodes": [[["tf_op_layer_concat_18", 0, 0, {}], ["conv_2d_1xS_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_21", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_21", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_20", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_20", "op": "ConcatV2", "input": ["concat_19", "conv_2d_1xS_21/Identity", "concat_20/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_20", "inbound_nodes": [[["tf_op_layer_concat_19", 0, 0, {}], ["conv_2d_1xS_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_22", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_22", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_21", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_21", "op": "ConcatV2", "input": ["concat_20", "conv_2d_1xS_22/Identity", "concat_21/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_21", "inbound_nodes": [[["tf_op_layer_concat_20", 0, 0, {}], ["conv_2d_1xS_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_23", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_23", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_22", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_22", "op": "ConcatV2", "input": ["concat_21", "conv_2d_1xS_23/Identity", "concat_22/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_22", "inbound_nodes": [[["tf_op_layer_concat_21", 0, 0, {}], ["conv_2d_1xS_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_24", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_24", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_23", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_23", "op": "ConcatV2", "input": ["concat_22", "conv_2d_1xS_24/Identity", "concat_23/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_23", "inbound_nodes": [[["tf_op_layer_concat_22", 0, 0, {}], ["conv_2d_1xS_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_25", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_25", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_24", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_24", "op": "ConcatV2", "input": ["concat_23", "conv_2d_1xS_25/Identity", "concat_24/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_24", "inbound_nodes": [[["tf_op_layer_concat_23", 0, 0, {}], ["conv_2d_1xS_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_26", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_26", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_25", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_25", "op": "ConcatV2", "input": ["concat_24", "conv_2d_1xS_26/Identity", "concat_25/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_25", "inbound_nodes": [[["tf_op_layer_concat_24", 0, 0, {}], ["conv_2d_1xS_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_27", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_27", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_26", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_26", "op": "ConcatV2", "input": ["concat_25", "conv_2d_1xS_27/Identity", "concat_26/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_26", "inbound_nodes": [[["tf_op_layer_concat_25", 0, 0, {}], ["conv_2d_1xS_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_28", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_28", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_27", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_27", "op": "ConcatV2", "input": ["concat_26", "conv_2d_1xS_28/Identity", "concat_27/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_27", "inbound_nodes": [[["tf_op_layer_concat_26", 0, 0, {}], ["conv_2d_1xS_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_29", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_29", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_28", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_28", "op": "ConcatV2", "input": ["concat_27", "conv_2d_1xS_29/Identity", "concat_28/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_28", "inbound_nodes": [[["tf_op_layer_concat_27", 0, 0, {}], ["conv_2d_1xS_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_30", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_30", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_29", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_29", "op": "ConcatV2", "input": ["concat_28", "conv_2d_1xS_30/Identity", "concat_29/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_29", "inbound_nodes": [[["tf_op_layer_concat_28", 0, 0, {}], ["conv_2d_1xS_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_31", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_31", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_30", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_30", "op": "ConcatV2", "input": ["concat_29", "conv_2d_1xS_31/Identity", "concat_30/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_30", "inbound_nodes": [[["tf_op_layer_concat_29", 0, 0, {}], ["conv_2d_1xS_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_32", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_32", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_31", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_31", "op": "ConcatV2", "input": ["concat_30", "conv_2d_1xS_32/Identity", "concat_31/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_31", "inbound_nodes": [[["tf_op_layer_concat_30", 0, 0, {}], ["conv_2d_1xS_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_33", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_33", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_32", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_32", "op": "ConcatV2", "input": ["concat_31", "conv_2d_1xS_33/Identity", "concat_32/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_32", "inbound_nodes": [[["tf_op_layer_concat_31", 0, 0, {}], ["conv_2d_1xS_33", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_34", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_34", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_33", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_33", "op": "ConcatV2", "input": ["concat_32", "conv_2d_1xS_34/Identity", "concat_33/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_33", "inbound_nodes": [[["tf_op_layer_concat_32", 0, 0, {}], ["conv_2d_1xS_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_35", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_35", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_34", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_34", "op": "ConcatV2", "input": ["concat_33", "conv_2d_1xS_35/Identity", "concat_34/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_34", "inbound_nodes": [[["tf_op_layer_concat_33", 0, 0, {}], ["conv_2d_1xS_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_36", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_36", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_35", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_35", "op": "ConcatV2", "input": ["concat_34", "conv_2d_1xS_36/Identity", "concat_35/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_35", "inbound_nodes": [[["tf_op_layer_concat_34", 0, 0, {}], ["conv_2d_1xS_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_37", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_37", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_36", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_36", "op": "ConcatV2", "input": ["concat_35", "conv_2d_1xS_37/Identity", "concat_36/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_36", "inbound_nodes": [[["tf_op_layer_concat_35", 0, 0, {}], ["conv_2d_1xS_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_38", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_38", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_37", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_37", "op": "ConcatV2", "input": ["concat_36", "conv_2d_1xS_38/Identity", "concat_37/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_37", "inbound_nodes": [[["tf_op_layer_concat_36", 0, 0, {}], ["conv_2d_1xS_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_39", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_39", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_38", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_38", "op": "ConcatV2", "input": ["concat_37", "conv_2d_1xS_39/Identity", "concat_38/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_38", "inbound_nodes": [[["tf_op_layer_concat_37", 0, 0, {}], ["conv_2d_1xS_39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_40", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_40", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_39", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_39", "op": "ConcatV2", "input": ["concat_38", "conv_2d_1xS_40/Identity", "concat_39/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_39", "inbound_nodes": [[["tf_op_layer_concat_38", 0, 0, {}], ["conv_2d_1xS_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_41", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_41", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_40", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_40", "op": "ConcatV2", "input": ["concat_39", "conv_2d_1xS_41/Identity", "concat_40/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_40", "inbound_nodes": [[["tf_op_layer_concat_39", 0, 0, {}], ["conv_2d_1xS_41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_42", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_42", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_41", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_41", "op": "ConcatV2", "input": ["concat_40", "conv_2d_1xS_42/Identity", "concat_41/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_41", "inbound_nodes": [[["tf_op_layer_concat_40", 0, 0, {}], ["conv_2d_1xS_42", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_43", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_43", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_42", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_42", "op": "ConcatV2", "input": ["concat_41", "conv_2d_1xS_43/Identity", "concat_42/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_42", "inbound_nodes": [[["tf_op_layer_concat_41", 0, 0, {}], ["conv_2d_1xS_43", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_44", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_44", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_43", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_43", "op": "ConcatV2", "input": ["concat_42", "conv_2d_1xS_44/Identity", "concat_43/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": 2}}, "name": "tf_op_layer_concat_43", "inbound_nodes": [[["tf_op_layer_concat_42", 0, 0, {}], ["conv_2d_1xS_44", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2d_1xS_45", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1024], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2d_1xS_45", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_44", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_44", "op": "ConcatV2", "input": ["concat_43", 